Tekla Open API Reference for Tekla Structures 2025
ModificationStamp Constructor (Int32, Int32)
 Creates a new modification stamp instance with the given local and server stamps. Can be used for fetching from the model history all the model objects that have been created or deleted after the specified stamp.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModificationStamp(
	int LocalStamp,
	int ServerStamp
)
Public Sub New (
	LocalStamp As Integer,
	ServerStamp As Integer
)
Parameters
LocalStamp
Type: System.Int32
The local stamp to be used for fetching the model changes after the stamp.
ServerStamp
Type: System.Int32
The server stamp for fetching the external multi-user or synchronized model changes after the stamp.
See Also
Reference
ModificationStamp Class
ModificationStamp Overload
Tekla.Structures.Model.History Namespace